src/cf/InformationRegisters/new_ЭлектроннаяОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>new_ЭлектроннаяОчередь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.new_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.new_РабочиеМестаЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/new_СтатусыЭлектроннойОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>new_СтатусыЭлектроннойОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыдаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/new_ЭлектроннаяОчередьСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
			
Процедура ПолучитьДанныеЭлектроннойОчереди(ТелоЗапроса, ПараметрыОтвета, ТекстОшибки) Экспорт
	
	// 2026.06.04 [Task-1]
	
	ПараметрыОтвета.Вставить("status_code", "200");
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		Попытка
			ЧтениеJSON 		 = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
			ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON,Ложь);
			ЧтениеJSON.Закрыть();
		Исключение
			ПараметрыОтвета.status_code = "500";
			Возврат ;
		КонецПопытки;
	Иначе
		ПараметрыОтвета.status_code = "404";
		Возврат;
	КонецЕсли;
	
	РабочиеМеста = Неопределено;
	
    ДанныеЗапроса.Свойство("Jobs", РабочиеМеста);
	
	Если Не ЗначениеЗаполнено(РабочиеМеста) Тогда
		ТекстОшибки = "Не заполнен список рабочих мест";		
		ПараметрыОтвета.status_code = "400";
		Возврат ;
	КонецЕсли;
	
	КВыдаче   = Новый Массив;
	Ожидающие = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.Заказ.Номер КАК ЗаказНомер,
		|	new_ЭлектроннаяОчередь.НомерТалона КАК НомерТалона,
		|	new_ЭлектроннаяОчередь.РабочееМесто.НомерОкна КАК РабочееМестоНомерОкна
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.РабочееМесто.ИдентификаторРабочегоМеста В(&СписокМест)
		|	И new_ЭлектроннаяОчередь.Статус = ЗНАЧЕНИЕ(Перечисление.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТалона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.Заказ.Номер КАК ЗаказНомер,
		|	new_ЭлектроннаяОчередь.НомерТалона КАК НомерТалона,
		|	new_ЭлектроннаяОчередь.РабочееМесто.НомерОкна КАК РабочееМестоНомерОкна
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.РабочееМесто.ИдентификаторРабочегоМеста В(&СписокМест)
		|	И new_ЭлектроннаяОчередь.Статус = ЗНАЧЕНИЕ(Перечисление.new_СтатусыЭлектроннойОчереди.ВСборке)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТалона";
	
	Запрос.УстановитьПараметр("СписокМест", РабочиеМеста);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	ВыборкаКВыдаче = Пакеты[0].Выбрать();
	
	Пока ВыборкаКВыдаче.Следующий() Цикл
		СтрГотовые = Новый Структура;	
		СтрГотовые.Вставить("Order", 		ВыборкаКВыдаче.ЗаказНомер);
		СтрГотовые.Вставить("Ticket", 		Строка(ВыборкаКВыдаче.НомерТалона));
		СтрГотовые.Вставить("WindowNumber", Строка(ВыборкаКВыдаче.НомерТалона));
		
		КВыдаче.Добавить(СтрГотовые);
	КонецЦикла;
	
	ВыборкаОжидающие = Пакеты[1].Выбрать();
	
	Пока ВыборкаОжидающие.Следующий() Цикл
		СтрОжидающие = Новый Структура;	
		СтрОжидающие.Вставить("Order", 			ВыборкаОжидающие.ЗаказНомер);
		СтрОжидающие.Вставить("Ticket", 		Строка(ВыборкаОжидающие.НомерТалона));
		СтрОжидающие.Вставить("WindowNumber", 	Строка(ВыборкаОжидающие.НомерТалона));
		
		Ожидающие.Добавить(СтрОжидающие);
	КонецЦикла;
	
	ПараметрыОтвета.Вставить("ForIssue", КВыдаче); 
	ПараметрыОтвета.Вставить("Waiting",  Ожидающие);

КонецПроцедуры	 

#КонецОбласти
